# Delete and Insert in pandas

Insert

In [1]:
import pandas as pd 
var = pd.DataFrame({"A":[1,2,3,4,5],"B":[9,8,7,6,5],"C":[11,12,13,14,15]})
var

   A  B   C
0  1  9  11
1  2  8  12
2  3  7  13
3  4  6  14
4  5  5  15

In [2]:
# var.insert(1,"Python_1",[11,12,13,14,15])
# var

In [3]:
# var["python_12"] = var["A"][0:3]
# var

Delete

In [4]:
var1 = var.pop("B")
var1

0    9
1    8
2    7
3    6
4    5
Name: B, dtype: int64

In [5]:
var

   A   C
0  1  11
1  2  12
2  3  13
3  4  14
4  5  15

In [ ]:
del var["A"]
var

    C
0  11
1  12
2  13
3  14
4  15